; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob11) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate11)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate12)
	(at pallet3 distributor0)
	(clear crate13)
	(at pallet4 distributor1)
	(clear crate7)
	(at pallet5 distributor2)
	(clear crate9)
	(at pallet6 distributor2)
	(clear crate5)
	(at pallet7 distributor1)
	(clear crate3)
	(at truck0 distributor2)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor2)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at crate0 depot2)
	(on crate0 pallet2)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 distributor2)
	(on crate2 pallet6)
	(at crate3 distributor1)
	(on crate3 pallet7)
	(at crate4 distributor2)
	(on crate4 pallet5)
	(at crate5 distributor2)
	(on crate5 crate2)
	(at crate6 depot2)
	(on crate6 crate0)
	(at crate7 distributor1)
	(on crate7 pallet4)
	(at crate8 depot0)
	(on crate8 pallet0)
	(at crate9 distributor2)
	(on crate9 crate4)
	(at crate10 distributor0)
	(on crate10 crate1)
	(at crate11 depot0)
	(on crate11 crate8)
	(at crate12 depot2)
	(on crate12 crate6)
	(at crate13 distributor0)
	(on crate13 crate10)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 pallet2)
		(on crate2 pallet7)
		(on crate3 pallet0)
		(on crate4 crate6)
		(on crate5 pallet3)
		(on crate6 crate11)
		(on crate8 pallet4)
		(on crate9 crate1)
		(on crate10 pallet6)
		(on crate11 pallet1)
		(on crate13 pallet5)
	)
))

; plan
1. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 0 of 12
2. (lift hoist7 crate11 crate8 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist7) (on crate11 crate8)
   added: (lifting hoist7 crate11) (clear crate8)
   goals met: 0 of 12
3. (load hoist7 crate11 truck1 depot0)
   deleted: (lifting hoist7 crate11)
   added: (in crate11 truck1) (available hoist7)
   goals met: 0 of 12
4. (lift hoist3 crate13 crate10 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist3) (on crate13 crate10)
   added: (lifting hoist3 crate13) (clear crate10)
   goals met: 0 of 12
5. (lift hoist8 crate10 crate1 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist8) (on crate10 crate1)
   added: (lifting hoist8 crate10) (clear crate1)
   goals met: 0 of 12
6. (lift hoist10 crate5 crate2 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist10) (on crate5 crate2)
   added: (lifting hoist10 crate5) (clear crate2)
   goals met: 0 of 12
7. (load hoist10 crate5 truck0 distributor2)
   deleted: (lifting hoist10 crate5)
   added: (in crate5 truck0) (available hoist10)
   goals met: 0 of 12
8. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 0 of 12
9. (load hoist8 crate10 truck0 distributor0)
   deleted: (lifting hoist8 crate10)
   added: (in crate10 truck0) (available hoist8)
   goals met: 0 of 12
10. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 0 of 12
11. (unload hoist6 crate10 truck0 distributor2)
   deleted: (in crate10 truck0) (available hoist6)
   added: (lifting hoist6 crate10)
   goals met: 0 of 12
12. (lift hoist5 crate2 pallet6 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet6)
   added: (lifting hoist5 crate2) (clear pallet6)
   goals met: 0 of 12
13. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 12
14. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 0 of 12
15. (unload hoist9 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist9)
   added: (lifting hoist9 crate5)
   goals met: 0 of 12
16. (load hoist3 crate13 truck0 distributor0)
   deleted: (lifting hoist3 crate13)
   added: (in crate13 truck0) (available hoist3)
   goals met: 0 of 12
17. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 0 of 12
18. (unload hoist5 crate13 truck0 distributor2)
   deleted: (in crate13 truck0) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 0 of 12
19. (drop hoist6 crate10 pallet6 distributor2)
   deleted: (lifting hoist6 crate10) (clear pallet6)
   added: (available hoist6) (at crate10 distributor2) (clear crate10) (on crate10 pallet6)
   goals met: 1 of 12
20. (lift hoist7 crate8 pallet0 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist7) (on crate8 pallet0)
   added: (lifting hoist7 crate8) (clear pallet0)
   goals met: 1 of 12
21. (load hoist7 crate8 truck1 depot0)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck1) (available hoist7)
   goals met: 1 of 12
22. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 1 of 12
23. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 1 of 12
24. (lift hoist6 crate9 crate4 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist6) (on crate9 crate4)
   added: (lifting hoist6 crate9) (clear crate4)
   goals met: 1 of 12
25. (load hoist6 crate9 truck0 distributor2)
   deleted: (lifting hoist6 crate9)
   added: (in crate9 truck0) (available hoist6)
   goals met: 1 of 12
26. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 1 of 12
27. (unload hoist8 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist8)
   added: (lifting hoist8 crate9)
   goals met: 1 of 12
28. (lift hoist6 crate4 pallet5 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist6) (on crate4 pallet5)
   added: (lifting hoist6 crate4) (clear pallet5)
   goals met: 1 of 12
29. (drop hoist5 crate13 pallet5 distributor2)
   deleted: (lifting hoist5 crate13) (clear pallet5)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 pallet5)
   goals met: 2 of 12
30. (lift hoist3 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 pallet3)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 2 of 12
31. (drop hoist9 crate5 pallet3 distributor0)
   deleted: (lifting hoist9 crate5) (clear pallet3)
   added: (available hoist9) (at crate5 distributor0) (clear crate5) (on crate5 pallet3)
   goals met: 3 of 12
32. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 3 of 12
33. (load hoist6 crate4 truck0 distributor2)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 3 of 12
34. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 3 of 12
35. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 3 of 12
36. (unload hoist11 crate11 truck1 depot1)
   deleted: (in crate11 truck1) (available hoist11)
   added: (lifting hoist11 crate11)
   goals met: 3 of 12
37. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 3 of 12
38. (drop hoist11 crate11 pallet1 depot1)
   deleted: (lifting hoist11 crate11) (clear pallet1)
   added: (available hoist11) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 4 of 12
39. (lift hoist4 crate3 pallet7 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet7)
   added: (lifting hoist4 crate3) (clear pallet7)
   goals met: 4 of 12
40. (load hoist4 crate3 truck1 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck1) (available hoist4)
   goals met: 4 of 12
41. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 4 of 12
42. (unload hoist7 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 4 of 12
43. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 4 of 12
44. (drop hoist7 crate3 pallet0 depot0)
   deleted: (lifting hoist7 crate3) (clear pallet0)
   added: (available hoist7) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 5 of 12
45. (lift hoist2 crate12 crate6 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist2) (on crate12 crate6)
   added: (lifting hoist2 crate12) (clear crate6)
   goals met: 5 of 12
46. (load hoist2 crate12 truck0 depot2)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   goals met: 5 of 12
47. (lift hoist2 crate6 crate0 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 crate0)
   added: (lifting hoist2 crate6) (clear crate0)
   goals met: 5 of 12
48. (load hoist2 crate6 truck0 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   goals met: 5 of 12
49. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 5 of 12
50. (unload hoist11 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist11)
   added: (lifting hoist11 crate4)
   goals met: 5 of 12
51. (unload hoist1 crate6 truck0 depot1)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 5 of 12
52. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 5 of 12
53. (lift hoist2 crate0 pallet2 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 5 of 12
54. (drop hoist1 crate6 crate11 depot1)
   deleted: (lifting hoist1 crate6) (clear crate11)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 crate11)
   goals met: 6 of 12
55. (drop hoist11 crate4 crate6 depot1)
   deleted: (lifting hoist11 crate4) (clear crate6)
   added: (available hoist11) (at crate4 depot1) (clear crate4) (on crate4 crate6)
   goals met: 7 of 12
56. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 7 of 12
57. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   goals met: 7 of 12
58. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 7 of 12
59. (unload hoist9 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 7 of 12
60. (drop hoist9 crate0 crate5 distributor0)
   deleted: (lifting hoist9 crate0) (clear crate5)
   added: (available hoist9) (at crate0 distributor0) (clear crate0) (on crate0 crate5)
   goals met: 8 of 12
61. (drop hoist3 crate1 crate0 distributor0)
   deleted: (lifting hoist3 crate1) (clear crate0)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 crate0)
   goals met: 8 of 12
62. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 8 of 12
63. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 8 of 12
64. (drop hoist4 crate2 pallet7 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet7)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet7)
   goals met: 9 of 12
65. (lift hoist9 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist9) (on crate1 crate0)
   added: (lifting hoist9 crate1) (clear crate0)
   goals met: 9 of 12
66. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 9 of 12
67. (load hoist9 crate1 truck0 distributor0)
   deleted: (lifting hoist9 crate1)
   added: (in crate1 truck0) (available hoist9)
   goals met: 9 of 12
68. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 9 of 12
69. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 9 of 12
70. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet2)
   goals met: 10 of 12
71. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 10 of 12
72. (load hoist8 crate9 truck0 distributor0)
   deleted: (lifting hoist8 crate9)
   added: (in crate9 truck0) (available hoist8)
   goals met: 10 of 12
73. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 10 of 12
74. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 10 of 12
75. (drop hoist2 crate9 crate1 depot2)
   deleted: (lifting hoist2 crate9) (clear crate1)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate1)
   goals met: 11 of 12
76. (lift hoist4 crate7 pallet4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 pallet4)
   added: (lifting hoist4 crate7) (clear pallet4)
   goals met: 11 of 12
77. (load hoist4 crate7 truck1 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck1) (available hoist4)
   goals met: 11 of 12
78. (unload hoist4 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 11 of 12
79. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 12 of 12
